module Control
    !*****************************常数部分**************************************
    real(kind=8),parameter::pi=3.14159265
    
    !*****************************网格控制部分***************************
  
    integer,parameter::imax=40,jmax=40,kmax=10  !计算域的最大网格点数,（o型网格，imax为奇数）   
   

    !*****************************迭代求解部分***********************************
    integer::itermax=10   !每层网格网格迭代次数
    real(kind=8),parameter::eps=1.0E-5   !x、y、z坐标收敛条件
    real(kind=8),parameter::omg=1.0    !迭代计算松弛因子（0-2）
    
    
    !***************************** 源项控制部分********************************
   
    real(kind=8),parameter::a=0.45,b=0.45,c=0.45,d=0.45,e=0.45,f=0.45  !源项插值指数因子
    real(kind=8),parameter::sigma=0.3   !源项修正迭代因子（0-2）(0-0.5)
    !网格的第一层边界理想间距
    real(kind=8)::d1=0.01
    !每层网格递进步长等比递增倍数
    real(kind=8)::lk_ratio=1.0 
    !每层网格正交性约束
    real(kind=8)::theta_rxz=pi/2,theta_rez=pi/2  !网格k线分别与i、j线的夹角
    
    !*******************************************************************************
       
end module