!参数控制模块
module Control
    !*****************************常数部分**************************************
    real(kind=8),parameter::pi=3.14159265
    
    !*****************************网格控制部分***************************
    integer,parameter::imax=40,jmax=40,kmax=20          !计算域的最大网格点数,（o型网格，imax为奇数）   
    
    !*****************************迭代求解部分***********************************
    integer::countmax=1                                 !外循环，源项更新次数
    integer::itermax=10                                 !每层网格网格迭代次数
    real(kind=8),parameter::eps=1.0E-5                  !x、y、z坐标收敛条件
    real(kind=8),parameter::omg=1.0                     !迭代计算松弛因子（0-2）
    
    !***************************** 源项控制部分********************************
    real(kind=8),parameter::a=0.45,b=0.45,c=0.45,d=0.45,e=0.45,f=0.45  !源项插值指数因子
    real(kind=8),parameter::sigma=0.3                                  !源项修正迭代因子（0-2）(0-0.5)
    !内外边界间距约束
    real(kind=8)::dd_inner=1.0E-4
    real(kind=8)::dd_outer=1.0E-2
    !每层网格正交性约束
    real(kind=8)::theta_rxz=pi/2,theta_rez=pi/2                        !网格k线分别与i、j线的夹角
    real(kind=8),parameter::eps1=1.0E-7,eps2=1.0E-6,eps3=1.0E-4        !此时内外间距和角度收敛条件(差距5度为：0.08726646,2度为0.03490658)
    !*******************************************************************************
       
end module